lib/CF/AutoDoc/Catalogs/Справочник1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Справочник1</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Реквизит1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Перечисление1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справочник2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитПереключатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справочник2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекСтрока1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекСтрока2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнойРеквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справочник2</v8:Type>
						<v8:Type>cfg:CatalogRef.Справочник3</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМеню</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитСписок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитБыстрыйВыбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справочник2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит1Копия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Перечисление1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитТекстовыйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитЧисло</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСправочник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справочник2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитБулево</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСправочникВыборИзФормыСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справочник2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитБыстрыйВыборТЧ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справочник2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МногострочнаяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизтПереносВЗаголовке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитЧисло</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСправочник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справочник2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитБулево</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитСправочникВыборИзФормыСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справочник2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lib/CF/AutoDoc/Catalogs/Справочник1/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Сообщить("Записываю элемент");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРекСтрока1(Команда)
	Объект.РекСтрока1 = "Значение1";
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРекСтрока2(Команда)
	Объект.РекСтрока2 = "Значение2";
КонецПроцедуры

&НаКлиенте
Процедура КомандаДляКомандногоИнтерфейса(Команда)
	Сообщить("КомандаДляКомандногоИнтерфейса");
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Сообщить("Закрытие формы.");
КонецПроцедуры

&НаКлиенте
Процедура Декорация2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	Объект.Наименование = "ТекстДекорацияФормыСсылка";
КонецПроцедуры

&НаКлиенте
Процедура РеквизитМенюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Список = Новый СписокЗначений;
	Список.Добавить("Товар",,Истина);
	Список.Добавить("Услуга",,Ложь);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМеню", ЭтаФорма, Параметры);
	ПоказатьВыборИзМеню(Оповещение, Список, Элементы.РеквизитМеню);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзМеню(ВыбранныйЭлемент, Параметры) Экспорт
	
	Объект.РеквизитМеню = ВыбранныйЭлемент;

КонецПроцедуры

&НаКлиенте
Процедура РеквизитСписокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Список = Новый СписокЗначений;
	Список.Добавить("Значение списка",,Истина);
	Список.Добавить("Тест",,Ложь);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзСписка", ЭтаФорма, Параметры);
	ПоказатьВыборИзСписка(Оповещение, Список, Элементы.РеквизитМеню);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзСписка(ВыбранныйЭлемент, Параметры) Экспорт
	
	Объект.РеквизитСписок = ВыбранныйЭлемент;

КонецПроцедуры

&НаКлиенте
Процедура ВывестиПредупреждение(Команда)
	ПоказатьПредупреждение(Неопределено,"Текст предупреждение!");
КонецПроцедуры

&НаКлиенте
Процедура ВвестиВНаименованиеИмяПользовтаеля(Команда)
	Объект.Наименование = ИмяПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗначениейСПометками(Команда)
	ФормаСпискаСПометками = ПолучитьФорму("Справочник.Справочник1.Форма.ФормаСпискаСПометками");
	ФормаСпискаСПометками.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМногострочнуюСтрокуВТЧ(Команда)
	СтрокаТЧ = Объект.ТабличнаяЧасть1.Добавить();
	СтрокаТЧ.МногострочнаяСтрока = "ПерваяСтрока" + Символы.ПС + "ВтораяСтрока";
	СтрокаТЧ = Объект.ТабличнаяЧасть1.Добавить();
	СтрокаТЧ.МногострочнаяСтрока = "ТретьяСтрока" + Символы.ПС + "ЧетвертаяСтрока";
КонецПроцедуры

&НаКлиенте
Процедура ВызватьИсключениеПроцедура(Команда)
	а = 1/0;
КонецПроцедуры


&НаКлиенте
Процедура КонтекстноеМенюНаименование(Команда)
	Сообщить("КонтекстноеМенюНаименование");
КонецПроцедуры

&НаКлиенте
Процедура КонтекстноеМенюТабличнаяЧасть1(Команда)
	Сообщить("КонтекстноеМенюТабличнаяЧасть1");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Стр1 = Новый ФорматированнаяСтрока("Ссылка1",,,,"Ссылка1");
	Стр2 = Новый ФорматированнаяСтрока("Ссылка2",,,,"Ссылка2");
	
	НадписьФорматированнаяСтрока = Новый ФорматированнаяСтрока(Стр1," ",Стр2);
КонецПроцедуры


&НаКлиенте
Процедура НадписьФорматированнаяСтрокаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Сообщить("НавигационнаяСсылкаФорматированнойСтроки="+НавигационнаяСсылкаФорматированнойСтроки);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНевидимаяГруппа1(Команда)
	Элементы.НевидимаяГруппа1.Видимость = Ложь;
	Элементы.ЭлементНевидимаяГруппа1.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНевидимаяГруппа21(Команда)
	Элементы.НевидимаяГруппа21.Видимость = Ложь;
	Элементы.ЭлементНевидимаяГруппа2.Видимость = Истина;
КонецПроцедуры


&НаКлиенте
Процедура КомандаВНевидимойТаблице(Команда)
	Сообщить("КомандаВНевидимойТаблице");
КонецПроцедуры


&НаКлиенте
Процедура СкрытьНевидимаяГруппа3(Команда)
	Элементы.НевидимаяГруппа3.Видимость = Ложь;
	Элементы.НевидимаяТаблица.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьКнопкуВТаблице(Команда)
	Элементы.НевидимаяТаблицаКомандаВНевидимойТаблице.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НедоступнаяКоманда(Команда)
	Сообщить("НедоступнаяКоманда");
КонецПроцедуры

&НаКлиенте
Процедура СделатьГруппуНедоступной(Команда)
	Элементы.НедоступнаяГруппа1.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаТолькоПросмотрНажатие(Элемент)
	Сообщить("ГиперссылкаТолькоПросмотрНажатиеКартинка");
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаТолькоПросмотр2Нажатие(Элемент)
	Сообщить("ГиперссылкаТолькоПросмотрНажатиеНадпись");
КонецПроцедуры

&НаКлиенте
Процедура СделатьГруппеТолькоПросмотр(Команда)
	Элементы.ГруппаТолькоПросмотр.ТолькоПросмотр = Истина;
КонецПроцедуры
